Управление_пожарной_частью_/src/Documents/ВыдачаВещевогоИмущества/ВыдачаВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.НоменклатураСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/AccumulationRegisters/НоменклатураНаСкладах/НоменклатураНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НоменклатураНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/AccumulationRegisters/НоменклатураСотрудников/НоменклатураСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НоменклатураСотрудников</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОстатокСрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/Documents/ВыдачаВещевогоИмущества/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.НоменклатураНаСкладах.Записывать = Истина;
	Движения.НоменклатураНаСкладах.Записать();
	Движения.НоменклатураНаСкладах.Записывать = Истина;
	Движения.НоменклатураСотрудников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Размер КАК Размер,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(ВыдачаВещевогоИмуществаВещевоеИмущество.Количество) КАК Количество,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.ПланДатаСписания КАК ПланДатаСписания
	|ПОМЕСТИТЬ ВТ_ВещевоеИмущество
	|ИЗ
	|	Документ.ВыдачаВещевогоИмущества.ВещевоеИмущество КАК ВыдачаВещевогоИмуществаВещевоеИмущество
	|ГДЕ
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Номенклатура,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Размер,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.Ссылка.ФизическоеЛицо,
	|	ВыдачаВещевогоИмуществаВещевоеИмущество.ПланДатаСписания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|	ВТ_ВещевоеИмущество.Размер КАК Размер,
	|	ВТ_ВещевоеИмущество.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВещевоеИмущество.Количество КАК Количество,
	|	ЕСТЬNULL(НоменклатураНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоНаСкладе,
	|	ВТ_ВещевоеИмущество.ПланДатаСписания КАК ПланДатаСписания
	|ИЗ
	|	ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НоменклатураНаСкладах.Остатки(
	|				&Дата,
	|				(Номенклатура, Размер) В
	|						(ВЫБРАТЬ
	|							ВТ_ВещевоеИмущество.Номенклатура КАК Номенклатура,
	|							ВТ_ВещевоеИмущество.Размер КАК Размер
	|						ИЗ
	|							ВТ_ВещевоеИмущество КАК ВТ_ВещевоеИмущество)
	|					И Склад = &Склад) КАК НоменклатураНаСкладахОстатки
	|		ПО ВТ_ВещевоеИмущество.Номенклатура = НоменклатураНаСкладахОстатки.Номенклатура
	|			И ВТ_ВещевоеИмущество.Размер = НоменклатураНаСкладахОстатки.Размер";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Количество > ВыборкаДетальныеЗаписи.КоличествоНаСкладе Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Номенклатуры ""%1"" не хватает на указанном складе в количестве %2 шт.", 
			ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Количество - ВыборкаДетальныеЗаписи.КоличествоНаСкладе);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.НоменклатураНаСкладах.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Организация = Организация;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
		Движение = Движения.НоменклатураСотрудников.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Организация = Организация;
		Движение.ФизическоеЛицо = ФизическоеЛицо;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Размер = ВыборкаДетальныеЗаписи.Размер;
		Движение.ПлановаяДатаСписания = ВыборкаДетальныеЗаписи.ПланДатаСписания;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
